package exam;

public class Example08 {
	public static void main(String[] args) {
		/*
		 *  연산자(Operator)
		 *  - 프로그램에서 데이터를 처리하여 결과를 산출하는 것을 연산(Opertation)이라고 한다
		 *  - 연산에 사용되는 표시나 기호를 연산자
		 *  - 연산되는 데이터는 피연산자라고 한다.
		 *  
		 *  a + b = c
		 *  +, = => 연산자
		 *  a + b => 항 피연산자
		 *  
		 *  단항 연산자: 피연산자 개수가 1개인 연산자
		 *  이항 연산자: 피연산자 개수가 2개인 연산자
		 *  삼항 연산자: 피연산자 개수가 3개인 연산자
		 *  
		 *  최우선 연산자 1순위
		 *  단항 연산자
		 *  산술 연산자
		 *  쉬프트 연산자
		 *  관계연산자
		 *  논리연산자
		 *  삼항연산자
		 *  대입연산자   마지막순위
		 */
	}
}
